{
  "basics": {
    "name": "Clément Detry",
    "label": "Machine Learning Engineer",
    "image": "",
    "email": "clementdetry@outlook.com",
    "phone": "+32 470 29 29 42",
    "url": "",
    "summary": "AI enthusiast with a BSc in Artificial Intelligence from Maastricht University and an MSc in Machine Learning from Université de Montréal and Mila Research Institute. Currently serving as an ML Engineer at HumanWare Technologies, dedicated to advancing vision algorithms for the benefit of the visually impaired. Driven by the AI for Good initiative to create a positive impact.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "",
        "username": "",
        "url": ""
      }
    ]
  },
  "education": [
    {
      "institution": "Université de Montréal, Mila - Quebec AI Institute",
      "location": "Montréal, CA",
      "url": "https://admission.umontreal.ca/programmes/maitrise-en-informatique/",
      "area": "Machine Learning",
      "studyType": "Master",
      "startDate": "2022-09-01",
      "endDate": "2024-01-01",
      "score": "",
      "courses": ["Data Science", "Machine Learning", "Representation Learning", "Natural Language Processing", "Big Data"]
    },
    {
      "institution": "Maastricht University",
      "location": "Maastricht, NL",
      "url": "https://curriculum.maastrichtuniversity.nl/education/bachelor/data-science-and-artificial-intelligence",
      "area": "Data Science and Artificial Intelligence",
      "studyType": "Bachelor",
      "startDate": "2018-09-01",
      "endDate": "2022-01-01",
      "score": "",
      "courses": ["Thesis: Identifying Patterns in Jaw Activities: Time Series Analysis of Sleep‑Related Data", "Supervisor: Prof. Rachel Cavill"]
    }
  ],
  "work": [
    {
      "name": "Nomics Care",
      "position": "Web Developer Intern",
      "url": "https://nomicscare.com/en/",
      "startDate": "2021-06-01",
      "endDate": "2021-08-01",
      "summary": "Liège, BE",
      "highlights": [
        "Initiated the migration of a Windows-based application for sleep activity signal analysis to a web server. This strategic shift was designed to simplify the user experience, enabling doctors to access patient analysis platforms from any device.",
        "Leveraged Django web framework to transition existing Python-based code for the web application development. This approach capitalized on the pre-existing codebase, streamlining the development process and maintaining system coherence.",
        "Developed the backend for user authentication interfaces and password management systems, and established an SQL database for storing user data. Concluded the internship by initiating the implementation of a dashboard feature for doctor’s patient data overview."
      ]
    },
    {
      "name": "Nomics Care",
      "position": "Data Scientist",
      "url": "https://nomicscare.com/en/",
      "startDate": "2021-09-01",
      "endDate": "2022-06-01",
      "summary": "Liège, BE",
      "highlights": [
        "Automated the detection of specific patterns in sleep time series data related to jaw activities, which were previously identified manually by doctors. The project aimed to streamline the diagnostic process by identifying patterns of “signal invalidity” and “awakeness”.",
        "Gathered time series data using the MNE-Python library and performed preprocessing with Pandas to clean and structure the dataset. Employed SMOTE oversampling to balance the data, ensuring it was well-suited for effective model training",
        "Implemented and evaluated supervised machine learning models, specifically a 1-D CNN and an LSTM, using Tensorflow and Keras frameworks. Results showed an overall validation F1-score of 0.98, indicating sufficient model performance in identifying the targeted sleep patterns."
      ]
    },
    {
      "name": "HumanWare Technologies",
      "position": "ML Engineer",
      "url": "https://www.humanware.com/en-canada/home",
      "startDate": "2023-05-01",
      "endDate": "Now",
      "summary": "Montréal, CA",
      "highlights": [
        "Initiated and led the development of an object detection task for visually impaired users to locate personal objects, leveraging the use of a GPS-based device equiped with dual cameras. This project aimed to enhance users' independence by facilitating the retrieval of their objects.",
        "Implemented and trained a custom PyTorch model using a few-shot learning approach. This model enables the detection of personal objects with only a few training examples",
        "Designed a recording mechanism using the SiamRPN tracking model from the PySOT library, allowing users to capture images of their objects",
        "Collaborated with software teams and beta-users to refine and optimize the model, focusing on its integration and usability."
      ]
    }
  ],
  "projects": [
    {
      "name": "Medical Image Segmentation",
      "summary": "Université de Montréal, Montréal, CA",
      "highlights": [
        "Worked within a three-person team on a project aimed at 3D medical image segmentation, utilizing CT and MRI scans. The objective was to assess and refine the architectural framework of a U-Net model to enhance its segmentation performance.", 
        "Implemented a series of strategic modifications to the U-Net model, including adjustments to the convolutional block, improvements in skip connections and the integration of a cross-attention mechanism. At the same time, established a standardized data preprocessing and augmentation pipeline, ensuring consistent and accurate evaluation of architectural changes across model iterations."
      ],
      "startDate": "2023-01-01",
      "endDate": "2023-05-01",
      "url": "https://clem2507.github.io/assets/pdf/MedicalSegmentationReport.pdf"
    },
    {
      "name": "Interactive Human vs Robot “Water Pong” Game",
      "summary": "Maastricht University, Maastricht, NL",
      "highlights": [
        "In a team of four, implemented an interactive “Water Pong” game with real-time computer vision, utilizing Hough Circle Transform in OpenCV for cup detection and YOLOv5 for ball tracking, facilitating accurate distance measurements.", 
        "Developed a lookup table for the robotic arm's throw parameters, correlating with cup positions, resulting in a target hitting accuracy of 90%."
      ],
      "startDate": "2021-09-01",
      "endDate": "2022-01-01",
      "url": "http://clem2507.github.io/assets/pdf/WaterPongReport.pdf"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "icon": "",
      "keywords": [
        "Python",
        "Java",
        "Matlab",
        "SQL"
      ]
    },
    {
      "name": "Frameworks",
      "level": "",
      "icon": "",
      "keywords": [
        "PyTorch",
        "Keras",
        "Tensorflow",
        "YOLO",
        "Django",
        "Flutter"
      ]
    },
    {
      "name": "Libraries",
      "level": "",
      "icon": "",
      "keywords": [
        "Numpy",
        "Pandas",
        "Matplotlib",
        "OpenCV",
        "Scikit-learn",
        "HuggingFace",
        "MLFlow",
        "Optuna",
        "MNE-Python"
      ]
    },
    {
      "name": "Other Tools",
      "level": "",
      "icon": "",
      "keywords": [
        "Git",
        "Docker",
        "LaTeX",
        "Jira"
      ]
    }
  ],
  "languages": [
    {
      "language": "French",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ]
}
