{"basics":{"name":"Clément Detry","position":"ML Engineer @ HumanWare Technologies","image":"","email":"clementdetry@outlook.com","phone":"+33 768 71 74 62","url":"","summary":"AI enthusiast with a BSc in Artificial Intelligence from Maastricht University and an MSc in Machine Learning from Université de Montréal and Mila Research Institute. I am currently serving as an ML Engineer at HumanWare Technologies, where I advance vision algorithms to aid the visually impaired. I am passionately driven by the AI for Good initiative, aiming to leverage technology to create positive societal impacts. I am particularly interested in finding opportunities that allow me to apply and further develop my expertise in natural language processing (NLP) projects.","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""},"profiles":[{"network":"","username":"","url":""}]},"work":[{"name":"Nomics Care","position":"Web Developer Intern","url":"https://nomicscare.com/en/","startDate":"2021-06-01","endDate":"2021-08-01","summary":"Liège, BE","highlights":["Initiated the migration of a Windows based app used by doctors for sleep signal analysis to a Django web server app, enabling access to patient analysis platforms from any device.","Developed the backend for user authentication and password management systems, and established an SQL database for storing user data."]},{"name":"Nomics Care","position":"Data Scientist","url":"https://nomicscare.com/en/","startDate":"2021-09-01","endDate":"2022-06-01","summary":"Liège, BE","highlights":["Employed machine learning models, including 1-D CNNs and LSTMs, for classifying specific patterns in time series for sleep apnea diagnosis, notably enhancing the accuracy from an F1 score of 0.7 to 0.98.","Managed large, non-structured time-series datasets, developing a robust preprocessing pipeline using the MNE-Python library and Pandas for data cleaning and structuring, along with SMOTE for data balancing.","Migrated the model to AWS, enabling server-based inference processing to support real-time data analysis in the application.","This optimized diagnostic process now reduces the time required for doctors to analyze each new patient by 50%."]},{"name":"HumanWare Technologies","position":"ML Engineer","url":"https://www.humanware.com/en-canada/home","startDate":"2023-05-01","endDate":"Now","summary":"Montréal, CA","highlights":["Led the development of an object detection system for visually impaired users, utilizing a GPS-equipped device with dual cameras to enhance user independence.","Engineered a lightweight PyTorch model using few-shot learning, optimized for high accuracy and local processing on embedded devices.","Achieved a 0.344 mAP@0.5:0.95 using 5-shot learning for diverse object shapes on an OOD dataset.","Developing a user-friendly image capture system using PySOT's SiamRPN tracking algorithm, enabling autonomous data collection adapted to visually impaired users."]}],"projects":[{"name":"Medical Image Segmentation","summary":"Université de Montréal, Montréal, CA","highlights":["Worked within a three-person team on a project aimed at 3D medical image segmentation, utilizing CT and MRI scans. The objective was to assess and refine the architectural framework of a U-Net model to enhance its segmentation performance.","Implemented a series of strategic modifications to the U-Net model, including adjustments to the convolutional block, improvements in skip connections and the integration of a cross-attention mechanism. At the same time, established a standardized data preprocessing and augmentation pipeline, ensuring consistent and accurate evaluation of architectural changes across model iterations.","Improved medical image segmentation by adding convolutional layers to shortcut paths, achieving the best overall performance with an average rank of 1.59 across various datasets."],"startDate":"2023-01-01","endDate":"2023-05-01","url":"https://clem2507.github.io/assets/pdf/MedicalSegmentationReport.pdf"},{"name":"Interactive Human vs Robot “Water Pong” Game","summary":"Maastricht University, Maastricht, NL","highlights":["Collaborated in a team of four to create an interactive ''Water Pong'' game featuring real-time computer vision. Utilized Hough Circle Transform in OpenCV for precise cup detection and YOLOv5 for ball tracking, enabling accurate distance measurements.","Engineered a lookup table for the robotic arm’s throw parameters, correlating with cup positions to achieve a target hitting accuracy of 90%."],"startDate":"2021-09-01","endDate":"2022-01-01","url":"http://clem2507.github.io/assets/pdf/WaterPongReport.pdf"}],"education":[{"institution":"Université de Montréal, Mila - Quebec AI Institute","location":"Montréal, CA","url":"https://admission.umontreal.ca/programmes/maitrise-en-informatique/","area":"Machine Learning (CGPA: 3.98/4.3)","studyType":"Master","startDate":"2022-09-01","endDate":"2024-01-01","courses":["Data Science","Machine Learning","Representation Learning (by Prof. Aaron Courville)","NLP"]},{"institution":"Maastricht University","location":"Maastricht, NL","url":"https://curriculum.maastrichtuniversity.nl/education/bachelor/data-science-and-artificial-intelligence","area":"Data Science and Artificial Intelligence (CGPA: 7.23/10)","studyType":"Bachelor","startDate":"2018-09-01","endDate":"2022-01-01","courses":["Thesis: Identifying Patterns in Jaw Activities: Time Series Analysis of Sleep‑Related Data","Supervisor: Prof. Rachel Cavill"]}],"skills":[{"name":"Progamming","level":"","icon":"","keywords":["Python (advanced)","Java (advanced)","Matlab (intermediate)","SQL (intermediate)","C++ (beginner)"]},{"name":"Libraries","level":"","icon":"","keywords":["PyTorch (advanced)","Scikit-learn (advanced)","Pandas (advanced)","Numpy (advanced)"]},{"name":"Other Tools","level":"","icon":"","keywords":["Git (advanced)","LaTeX (advanced)","Docker (intermediate)"]}],"languages":[{"language":"French","fluency":"Native","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"Dutch","fluency":"Intermediate","icon":""}]}